javnson/gmp_pro/csp/c28x_syscfg/launchpad/C2000Lib_F280049C/LAUNCHXL_F280049C.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --board "/boards/LAUNCHXL_F280049C" --context "system" --product "C2000WARE@5.04.00.00"
 * @v2CliArgs --device "TMS320F280049C" --package "100PZ" --context "system" --product "gmp_pro@1.00.00.05" --product "C2000WARE@5.04.00.00"
 * @versions {"tool":"1.21.0+3721"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc            = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1           = adc.addInstance();
const adc2           = adc.addInstance();
const adc3           = adc.addInstance();
const asysctl        = scripting.addModule("/driverlib/asysctl.js");
const can            = scripting.addModule("/driverlib/can.js", {}, false);
const can1           = can.addInstance();
const dac            = scripting.addModule("/driverlib/dac.js", {}, false);
const dac1           = dac.addInstance();
const dac2           = dac.addInstance();
const device_support = scripting.addModule("/driverlib/device_support.js");
device_support.useStandardCodeStartBranch = false;
const epwm           = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1          = epwm.addInstance();
const epwm2          = epwm.addInstance();
const epwm3          = epwm.addInstance();
const epwm4          = epwm.addInstance();
const epwm5          = epwm.addInstance();
const epwm6          = epwm.addInstance();
const eqep           = scripting.addModule("/driverlib/eqep.js", {}, false);
const eqep1          = eqep.addInstance();
const eqep2          = eqep.addInstance();
const gpio           = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1          = gpio.addInstance();
const gpio2          = gpio.addInstance();
const sci            = scripting.addModule("/driverlib/sci.js", {}, false);
const sci1           = sci.addInstance();
const spi            = scripting.addModule("/driverlib/spi.js", {}, false);
const spi1           = spi.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
// BOOSTXL J3/J7 analog resources. The 7/3/6 split follows the fixed
// ADCA/ADCB/ADCC pin mux of the LaunchXL-F280049C and uses continuous SOCs.
adc1.$name                          = "BOOSTXL_ADCA";
adc1.adcClockPrescaler              = "ADC_CLK_DIV_2_0";
adc1.enabledSOCs                    = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5"];
adc1.enabledInts                    = ["ADC_INT_NUMBER1"];
adc1.enableInterrupt1               = true;
adc1.enableInterrupt1ContinuousMode = true;
adc1.registerInterrupts             = ["1"];
adc1.adcInt1.enableInterrupt        = true;
adc1.adcInt1.interruptHandler       = "MainISR";
adc1.soc0Name = "BOOSTXL_ADC23"; adc1.soc0IndependentNameMode = true; adc1.soc0Channel = "ADC_CH_ADCIN5"; adc1.soc0SampleWindow = 8; adc1.soc0Trigger = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc1Name = "BOOSTXL_ADC29"; adc1.soc1IndependentNameMode = true; adc1.soc1Channel = "ADC_CH_ADCIN9"; adc1.soc1SampleWindow = 8; adc1.soc1Trigger = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc3Name = "BOOSTXL_ADC63"; adc1.soc3IndependentNameMode = true; adc1.soc3Channel = "ADC_CH_ADCIN6"; adc1.soc3SampleWindow = 8; adc1.soc3Trigger = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc4Name = "BOOSTXL_ADC64"; adc1.soc4IndependentNameMode = true; adc1.soc4Channel = "ADC_CH_ADCIN2"; adc1.soc4SampleWindow = 8; adc1.soc4Trigger = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc5Name = "BOOSTXL_ADC69"; adc1.soc5IndependentNameMode = true; adc1.soc5Channel = "ADC_CH_ADCIN3"; adc1.soc5SampleWindow = 8; adc1.soc5Trigger = "ADC_TRIGGER_EPWM1_SOCA";

adc2.$name                   = "BOOSTXL_ADCB";
adc2.adcBase                 = "ADCB_BASE";
adc2.adcClockPrescaler       = "ADC_CLK_DIV_2_0";
adc2.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2"];
adc2.soc0Name = "BOOSTXL_ADC24"; adc2.soc0IndependentNameMode = true; adc2.soc0Channel = "ADC_CH_ADCIN0"; adc2.soc0SampleWindow = 8; adc2.soc0Trigger = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc1Name = "BOOSTXL_ADC26"; adc2.soc1IndependentNameMode = true; adc2.soc1Channel = "ADC_CH_ADCIN1"; adc2.soc1SampleWindow = 8; adc2.soc1Trigger = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc2Name = "BOOSTXL_ADC27"; adc2.soc2IndependentNameMode = true; adc2.soc2Channel = "ADC_CH_ADCIN2"; adc2.soc2SampleWindow = 8; adc2.soc2Trigger = "ADC_TRIGGER_EPWM1_SOCA";

adc3.$name                   = "BOOSTXL_ADCC";
adc3.adcBase                 = "ADCC_BASE";
adc3.adcClockPrescaler       = "ADC_CLK_DIV_2_0";
adc3.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5"];
adc3.soc0Name = "BOOSTXL_ADC25"; adc3.soc0IndependentNameMode = true; adc3.soc0Channel = "ADC_CH_ADCIN2";  adc3.soc0SampleWindow = 8; adc3.soc0Trigger = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc1Name = "BOOSTXL_ADC28"; adc3.soc1IndependentNameMode = true; adc3.soc1Channel = "ADC_CH_ADCIN0";  adc3.soc1SampleWindow = 8; adc3.soc1Trigger = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc2Name = "BOOSTXL_ADC65"; adc3.soc2IndependentNameMode = true; adc3.soc2Channel = "ADC_CH_ADCIN14"; adc3.soc2SampleWindow = 8; adc3.soc2Trigger = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc3Name = "BOOSTXL_ADC66"; adc3.soc3IndependentNameMode = true; adc3.soc3Channel = "ADC_CH_ADCIN1";  adc3.soc3SampleWindow = 8; adc3.soc3Trigger = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc4Name = "BOOSTXL_ADC67"; adc3.soc4IndependentNameMode = true; adc3.soc4Channel = "ADC_CH_ADCIN3";  adc3.soc4SampleWindow = 8; adc3.soc4Trigger = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc5Name = "BOOSTXL_ADC68"; adc3.soc5IndependentNameMode = true; adc3.soc5Channel = "ADC_CH_ADCIN5";  adc3.soc5SampleWindow = 8; adc3.soc5Trigger = "ADC_TRIGGER_EPWM1_SOCA";

can1.$name                 = "LAUNCHXL_CAN";
can1.bitRate               = "1000000";
can1.enableInterrupt       = true;
can1.registerInterrupts    = true;
can1.interruptFlags        = ["CAN_INT_IE0"];
can1.interruptLine         = ["CAN_GLOBAL_INT_CANINT0"];
can1.msgObjsUsed           = [1,2,3,4,5,6,7,8,9,10];
can1.can.$assign           = "CANA";
can1.can.can_rxPin.$assign = "GPIO33";
can1.can.can_txPin.$assign = "GPIO32";
can1.msgObj1.$name         = "msgObj0";
can1.msgObj1.msgID         = 257;
can1.msgObj2.$name         = "msgObj1";
can1.msgObj2.msgID         = 258;
can1.msgObj3.$name         = "msgObj2";
can1.msgObj3.msgID         = 259;
can1.msgObj4.$name         = "msgObj3";
can1.msgObj4.msgID         = 513;
can1.msgObj4.msgType       = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj5.$name         = "msgObj4";
can1.msgObj5.msgID         = 514;
can1.msgObj5.msgType       = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj6.$name         = "msgObj5";
can1.msgObj6.msgID         = 515;
can1.msgObj6.msgType       = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj7.$name         = "msgObj6";
can1.msgObj7.msgID         = 516;
can1.msgObj7.msgType       = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj8.$name         = "msgObj8";
can1.msgObj8.msgID         = 517;
can1.msgObj8.msgType       = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj9.$name         = "msgObj7";
can1.msgObj9.msgID         = 518;
can1.msgObj9.msgType       = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj10.$name        = "msgObj9";
can1.msgObj10.msgID        = 519;
can1.msgObj10.msgType      = "CAN_MSG_OBJ_TYPE_TX";

const multiplier2         = system.clockTree["PLL_IMULT"];
multiplier2.multiplyValue = 10;

const mux2       = system.clockTree["OSCCLKSRCSEL"];
mux2.inputSelect = "X1_XTAL";

